run/032-pbbi-gems-speciation/system/controlDict
/*------------------------------------------------------------------------------

system/controlDict of tests/phaseChange/channel

  dt = 1 ms, 200 steps, written every 50 steps in binary.

------------------------------------------------------------------------------*/
FoamFile {version 2.0; format ascii; class dictionary; object controlDict;}

application       rhoFixedFlowFoam;
startFrom         latestTime;
startTime         0;
stopAt            endTime;
endTime           3;
deltaT 0.001;
writeControl      timeStep;
writeInterval 3000;
purgeWrite        0;
writeFormat       ascii;
writeCompression  off;
timeFormat        general;
timePrecision     6;
runTimeModifiable false;

speciesTransport {
  tolerance          1e-12;
  nCorr              3;
  writeFrozenFields  no;
}

writePrecision 17;
