run/032-pbbi-gems-speciation/system/blockMeshDict
/*------------------------------------------------------------------------------

system/blockMeshDict of tests/phaseChange/channel

  Plane channel, L = 0.1 m, H = 4.8 mm, 100 x 24 cells (1 mm x 0.2 mm),
  WALL on both sides, INLET at x = 0, OUTLET at x = L, one cell in z.

------------------------------------------------------------------------------*/
FoamFile {version 2.0; format ascii; class dictionary; object blockMeshDict;}

scale 1;

vertices (
  (0   0      0) (0.1 0      0) (0.1 4.8e-3    0) (0 4.8e-3    0)
  (0   0   1e-3) (0.1 0   1e-3) (0.1 4.8e-3 1e-3) (0 4.8e-3 1e-3)
);

blocks (hex (0 1 2 3 4 5 6 7) (100 24 1) simpleGrading (1 1 1));

boundary (
  INLET     {type patch; faces ((0 4 7 3));}
  OUTLET    {type patch; faces ((1 2 6 5));}
  WALL      {type patch; faces ((0 1 5 4) (3 7 6 2));}
  FRONTBACK {type empty; faces ((0 3 2 1) (4 5 6 7));}
);
