run/032-pbbi-gems-speciation/0/T
FoamFile {version 2.0; format ascii; class volScalarField; object T;}
dimensions    [0 0 0 1 0 0 0];
internalField uniform 700;
boundaryField {
  "(INLET|OUTLET|WALL)" {type calculated; value uniform 700;}
  FRONTBACK {type empty;}
}
