run/032-pbbi-gems-speciation/system/fvSchemes
FoamFile {version 2.0; format ascii; class dictionary; object fvSchemes;}
ddtSchemes {default Euler;}
gradSchemes {default Gauss linear;}
divSchemes {default none; div(phi,Y_Pb_g) Gauss upwind; div(phi,Y_PbI_g) Gauss upwind; div(phi,Y_Bi_g) Gauss upwind; div(phi,Y_Bi2_g) Gauss upwind; div(phi,Y_BiI_g) Gauss upwind; div(phi,Y_I_g) Gauss upwind; div(phi,Y_I2_g) Gauss upwind;  div(phi,Y_PbI2_g) Gauss upwind; div(phi,Y_BiI3_g) Gauss upwind;}
laplacianSchemes {default Gauss linear corrected;}
interpolationSchemes {default linear;}
snGradSchemes {default corrected;}
